pegasus/test/wetest/wsman/HttpHeader/Http1_0Post01rspgood.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xml="http://www.w3.org/XML/1998/namespace" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:wsmb="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wxf="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:wsen="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl" xmlns:wscim="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2">
<SOAP-ENV:Header>
<wsa:To>
http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous
</wsa:To>
<wsa:Action>
http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse
</wsa:Action>
<wsa:MessageID>
uuid:00000000-0000-0000-0000-000000000000
</wsa:MessageID>
<wsa:RelatesTo>
uuid:00000000-0000-0000-0001-000000000006
</wsa:RelatesTo>
</SOAP-ENV:Header>
<SOAP-ENV:Body>
<p:PG_TestPropertyTypes xmlns:p="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/PG_TestPropertyTypes">
<p:CreationClassName>
PG_TestPropertyTypes
</p:CreationClassName>
<p:InstanceId>
1
</p:InstanceId>
<p:PropertyBoolean>
true
</p:PropertyBoolean>
<p:PropertyDatetime>
P20010515DT10H43M54S
</p:PropertyDatetime>
<p:PropertyReal32>
1.1234567165374756e+00
</p:PropertyReal32>
<p:PropertyReal64>
1.1234567890654321e+00
</p:PropertyReal64>
<p:PropertySint16>
-1600
</p:PropertySint16>
<p:PropertySint32>
-3200
</p:PropertySint32>
<p:PropertySint64>
-6400
</p:PropertySint64>
<p:PropertySint8>
-120
</p:PropertySint8>
<p:PropertyString>
PG_TestPropertyTypes_Instance1
</p:PropertyString>
<p:PropertyUint16>
1600
</p:PropertyUint16>
<p:PropertyUint32>
3200
</p:PropertyUint32>
<p:PropertyUint64>
6400
</p:PropertyUint64>
<p:PropertyUint8>
120
</p:PropertyUint8>
</p:PG_TestPropertyTypes>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
